; domain
(define (domain spqr-task-planning)
  (:requirements :typing :action-costs)	
	(:predicates 	
		
		(location ?loc)				
	
		(OBJ ?o)
		
		(ROBOT ?r)		
		(SLOT ?sl)
		(emptySLOT ?sl)
		
		(obj-at-location ?o ?loc)
		(onSLOT ?o ?sl)
		
		(robot-at-location ?r ?loc)		
		(edge ?loc1 ?loc2)
	
)

(:action TAKE-OBJ-FROM-LOCATION
  :parameters
   (?r
    ?o
    ?loc
    ?sl
  )
  :precondition
   (and (ROBOT ?r)(location ?loc)(OBJ ?o)(SLOT ?sl)(obj-at-location ?o ?loc)(robot-at-location ?r ?loc)(emptySLOT ?sl))
  :effect
   (and (not(obj-at-location ?o ?loc))(not(emptySLOT ?sl))(onSLOT ?o ?sl))
) 
	
 (:action DROP-OBJECT
  :parameters
   (?r
    ?o
    ?loc
    ?sl
  )
  :precondition
   (and (ROBOT ?r)(location ?loc)(OBJ ?o)(SLOT ?sl)(onSLOT ?o ?sl)(robot-at-location ?r ?loc)(not(emptySLOT ?sl)))
  :effect
   (and (obj-at-location ?o ?loc)(emptySLOT ?sl)(not(onSLOT ?o ?sl)))
) 

(:action MOVE
  :parameters
   (?r
    ?pFrom
    ?pTo
  )
  :precondition
   (and (ROBOT ?r)(location ?pFrom)(location ?pTo)(edge ?pFrom ?pTo)(robot-at-location ?r ?pFrom)(not(robot-at-location ?r ?pTo)))
  :effect
   (and (not(robot-at-location ?r ?pFrom))(robot-at-location ?r ?pTo))
 )
)

; problem
(define (problem spqr-planning)
   (:domain spqr-task-planning)
	(:objects
	    youbot
	    slot1
	    slot2
	    slot3

	    WS05
	    WS06
	    WPS
	    WPS_1
	    WPS_2
	    WPS_3
	    WPS_4
	    WPS_5

	    AXIS
	    BEARING
	    S40_40_B1
	    M20
	    S40_40_B

	)
	(:init
	    (ROBOT youbot)
	    (SLOT slot1)
	    (SLOT slot2)
	    (SLOT slot3)

	    (OBJ AXIS)
	    (OBJ BEARING)
	    (OBJ S40_40_B1)
	    (OBJ M20)
	    (OBJ S40_40_B)

	    (location WS05)
	    (location WS06)
	    (location WPS)
	    (location WPS_1)
	    (location WPS_2)
	    (location WPS_3)
	    (location WPS_4)
	    (location WPS_5)

	    (edge WPS WPS_1)
	    (edge WPS_1 WPS_2)
	    (edge WPS_2 WPS_3)
	    (edge WPS_3 WPS_4)
	    (edge WPS_4 WPS_5)
	    (edge WPS_5 WS05)
	    (edge WS05 WS06)
	    (edge WS06 WS05)

	    (emptySLOT slot1)
	    (emptySLOT slot2)
	    (emptySLOT slot3)

	    (robot-at-location youbot WPS)

	    (obj-at-location AXIS WS05)
	    (obj-at-location BEARING WS05)
	    (obj-at-location S40_40_B1 WS05)
	    (obj-at-location M20 WS05)
	    (obj-at-location S40_40_B WS05)

	)
	(:goal
               (and 
          	    (obj-at-location AXIS WS06)
          	    (obj-at-location BEARING WS06)
          	    (obj-at-location S40_40_B1 WS06)
          	    (obj-at-location M20 WS06)
          	    (obj-at-location S40_40_B WS06)
               )
	)
)

; plan
1. (move youbot wps wps_1)
   deleted: (robot-at-location youbot wps)
   added: (robot-at-location youbot wps_1)
   goals met: 0 of 5
2. (move youbot wps_1 wps_2)
   deleted: (robot-at-location youbot wps_1)
   added: (robot-at-location youbot wps_2)
   goals met: 0 of 5
3. (move youbot wps_2 wps_3)
   deleted: (robot-at-location youbot wps_2)
   added: (robot-at-location youbot wps_3)
   goals met: 0 of 5
4. (move youbot wps_3 wps_4)
   deleted: (robot-at-location youbot wps_3)
   added: (robot-at-location youbot wps_4)
   goals met: 0 of 5
5. (move youbot wps_4 wps_5)
   deleted: (robot-at-location youbot wps_4)
   added: (robot-at-location youbot wps_5)
   goals met: 0 of 5
6. (move youbot wps_5 ws05)
   deleted: (robot-at-location youbot wps_5)
   added: (robot-at-location youbot ws05)
   goals met: 0 of 5
7. (take-obj-from-location youbot axis ws05 slot1)
   deleted: (obj-at-location axis ws05) (emptyslot slot1)
   added: (onslot axis slot1)
   goals met: 0 of 5
8. (take-obj-from-location youbot bearing ws05 slot2)
   deleted: (obj-at-location bearing ws05) (emptyslot slot2)
   added: (onslot bearing slot2)
   goals met: 0 of 5
9. (take-obj-from-location youbot m20 ws05 slot3)
   deleted: (obj-at-location m20 ws05) (emptyslot slot3)
   added: (onslot m20 slot3)
   goals met: 0 of 5
10. (move youbot ws05 ws06)
   deleted: (robot-at-location youbot ws05)
   added: (robot-at-location youbot ws06)
   goals met: 0 of 5
11. (drop-object youbot axis ws06 slot1)
   deleted: (onslot axis slot1)
   added: (obj-at-location axis ws06) (emptyslot slot1)
   goals met: 1 of 5
12. (drop-object youbot bearing ws06 slot2)
   deleted: (onslot bearing slot2)
   added: (obj-at-location bearing ws06) (emptyslot slot2)
   goals met: 2 of 5
13. (drop-object youbot m20 ws06 slot3)
   deleted: (onslot m20 slot3)
   added: (obj-at-location m20 ws06) (emptyslot slot3)
   goals met: 3 of 5
14. (move youbot ws06 ws05)
   deleted: (robot-at-location youbot ws06)
   added: (robot-at-location youbot ws05)
   goals met: 3 of 5
15. (take-obj-from-location youbot s40_40_b ws05 slot1)
   deleted: (obj-at-location s40_40_b ws05) (emptyslot slot1)
   added: (onslot s40_40_b slot1)
   goals met: 3 of 5
16. (take-obj-from-location youbot s40_40_b1 ws05 slot2)
   deleted: (obj-at-location s40_40_b1 ws05) (emptyslot slot2)
   added: (onslot s40_40_b1 slot2)
   goals met: 3 of 5
17. (move youbot ws05 ws06)
   deleted: (robot-at-location youbot ws05)
   added: (robot-at-location youbot ws06)
   goals met: 3 of 5
18. (drop-object youbot s40_40_b ws06 slot1)
   deleted: (onslot s40_40_b slot1)
   added: (obj-at-location s40_40_b ws06) (emptyslot slot1)
   goals met: 4 of 5
19. (drop-object youbot s40_40_b1 ws06 slot2)
   deleted: (onslot s40_40_b1 slot2)
   added: (obj-at-location s40_40_b1 ws06) (emptyslot slot2)
   goals met: 5 of 5
